//代入演算子　（データの入れ替えを行う演算子）

//単独代入：「=」

//複合代入：　（論理型）「&&= ||= ??=」
//複合代入：　（算術型）「+=, -=, *=, /=, %=, **=」

/*----------------------------------------------------------------------*/

//複合代入：　（算術型）「+=, -=, *=, /=, %=, **=」

//number型と使う場合：

let x = 10;

x += 5;//15
x -= 3;//12 データを保持して入れ替える。
x *= 2;//24

console.log(x);

//string型と使う場合：

let msg = "hello";

msg += " world";

console.log(msg);//hello world

/*----------------------------------------------------------------------*/

//複合代入：　（論理（判断）型）「&&= ||= ??=」

//値が特定の条件を満たすときだけ代入を行う演算子です。

//truthy値：true, 数値（０以外）, 文字列 ,　配列,  オブジェクト,  関数など

//falsy値：false, 0, "", null, undefined, NaN

//nullish値： null, undefined　ー＞実際はfalsyでありながらnullishに所属しております


//①　&&= (and)

let z = 0.1;

z &&= 200;

console.log(z);//200

//②　||= (or)

let k = "";

k ||= 300;

console.log(k);//300


//③　??= (nullish)

let y = null;

y ??= 400;

console.log(y);//400







